<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Province;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class IranProvincesCitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Array of Iranian provinces with their respective cities
        $iranProvinces = [
            'آذربایجان شرقی' => ['تبریز', 'مراغه', 'سراب', 'ميانه'],
            'آذربایجان غربی' => ['ارومیه', 'مهاباد', 'خوی', 'سلماس', 'میاندوآب'],
            'اردبیل' => ['اردبیل', 'مشگین شهر', 'پارس آباد', 'کوثر', 'نمین'],
            'اصفهان' => ['اصفهان', 'کاشان', 'نایین', 'شاهین‌شهر', 'گلپایگان'],
            'البرز' => ['هشتگرد', 'ملارد', 'نظرآباد', 'ساوجبلاغ'],
            'ایلام' => ['ایلام', 'دهلران', 'آبدانان', 'آسمان آباد', 'شیروان و چرداول'],
            'بوشهر' => ['بوشهر', 'دشتستان', 'گناوه', 'دشتی', 'جم'],
            'تهران' => ['تهران', 'کرج', 'ری', 'شهریار', 'ورامین'],
            'چهارمحال و بختیاری' => ['شهرکرد', 'بروجن', 'لردگان', 'فارسان', 'سامان'],
            'خراسان جنوبی' => ['بیرجند', 'درمیان', 'نهبندان', 'زیرکوه', 'سربیشه'],
            'خراسان رضوی' => ['مشهد', 'نیشابور', 'سبزوار', 'تربت حیدریه', 'تربت جام'],
            'خراسان شمالی' => ['بجنورد', 'شیروان', 'گرمه', 'راز', 'فاروج'],
            'خوزستان' => ['اهواز', 'بهبهان', 'هندیجان', 'شوش'],
            'زنجان' => ['زنجان', 'خدابنده', 'قیدار', 'آب بر', 'سلطانیه'],
            'سمنان' => ['سمنان', 'شاهرود', 'گرمسار', 'دامغان', 'مهدیشهر'],
            'سیستان و بلوچستان' => ['زاهدان', 'چابهار', 'خاش', 'ایرانشهر', 'سراوان'],
            'فارس' => ['شیراز', 'مرودشت', 'استهبان', 'لار', 'فسا'],
            'قزوین' => ['قزوین', 'تاکستان', 'آبیک', 'بوئین زهرا', 'البرز'],
            'قم' => ['قم', 'جعفریه', 'کهک', 'سلفچگان', 'دستجرد'],
            'کردستان' => ['سنندج', 'مریوان', 'بانه', 'سقز', 'دهگلان'],
            'کرمان' => ['کرمان', 'رفسنجان', 'بم', 'جیرفت', 'سیرجان'],
            'کرمانشاه' => ['کرمانشاه', 'کنگاور', 'هرسین', 'سنقر', 'پاوه'],
            'کهگیلویه و بویراحمد' => ['یاسوج', 'دهدشت', 'گچساران', 'بهمئی', 'دوگنبدان'],
            'گلستان' => ['گرگان', 'گنبدکاووس', 'آق قلا', 'کلاله', 'علی‌آباد'],
            'گیلان' => ['رشت', 'انزلی', 'لاهیجان', 'رودسر', 'آستارا'],
            'لرستان' => ['خرم‌آباد', 'دورود', 'بروجرد', 'الیگودرز', 'کوهدشت'],
            'مازندران' => ['ساری', 'بابل', 'آمل', 'نور', 'قائم‌شهر'],
            'مرکزی' => ['اراک', 'ساوه', 'خمین', 'دلیجان', 'شازند'],
            'هرمزگان' => ['بندرعباس', 'بندرلنگه', 'قشم', 'میناب', 'کیش'],
            'همدان' => ['همدان', 'ملایر', 'نهاوند', 'تویسرکان', 'رزن'],
            'یزد' => ['یزد', 'مهریز', 'اردکان', 'بافق', 'ابرکوه'],
        ];

        // Save provinces and cities to the database
        foreach ($iranProvinces as $provinceName => $cities) {
            // Create a new province record in the database
            $province = Province::create(['name' => $provinceName]);

            // Create city records for each province
            foreach ($cities as $cityName) {
                City::create([
                    'name' => $cityName,
                    'province_id' => $province->id,
                ]);
            }
        }
    }
}
